output/ignite-sql-a-14-1000Mbps-3ms-10000-1000-4-run-1.out
[08:27:47][INFO ][Thread-3] Start Ignite client node.
[08:27:47][INFO ][Thread-3] 

>>>    __________  ________________  
>>>   /  _/ ___/ |/ /  _/_  __/ __/  
>>>  _/ // (7 7    // /  / / / _/    
>>> /___/\___/_/|_/___/ /_/ /___/   
>>> 
>>> ver. 2.7.0#20181130-sha1:256ae401
>>> 2018 Copyright(C) Apache Software Foundation
>>> 
>>> Ignite documentation: http://ignite.apache.org

[08:27:47][INFO ][Thread-3] Config URL: n/a
[08:27:47][INFO ][Thread-3] IgniteConfiguration [igniteInstanceName=YCSB client node, pubPoolSize=12, svcPoolSize=12, callbackPoolSize=12, stripedPoolSize=12, sysPoolSize=12, mgmtPoolSize=4, igfsPoolSize=12, dataStreamerPoolSize=12, utilityCachePoolSize=12, utilityCacheKeepAliveTime=60000, p2pPoolSize=2, qryPoolSize=12, igniteHome=null, igniteWorkDir=/tmp/ignite/work, mbeanSrv=com.sun.jmx.mbeanserver.JmxMBeanServer@954b04f, nodeId=52283a70-2150-44ff-8dd7-d664ba8cd78b, marsh=BinaryMarshaller [], marshLocJobs=false, daemon=false, p2pEnabled=false, netTimeout=2000, sndRetryDelay=1000, sndRetryCnt=3, metricsHistSize=10000, metricsUpdateFreq=2000, metricsExpTime=9223372036854775807, discoSpi=TcpDiscoverySpi [addrRslvr=null, sockTimeout=0, ackTimeout=0, marsh=null, reconCnt=10, reconDelay=2000, maxAckTimeout=600000, forceSrvMode=false, clientReconnectDisabled=false, internalLsnr=null], segPlc=STOP, segResolveAttempts=2, waitForSegOnStart=true, allResolversPassReq=true, segChkFreq=10000, commSpi=TcpCommunicationSpi [connectGate=null, connPlc=org.apache.ignite.spi.communication.tcp.TcpCommunicationSpi$FirstConnectionPolicy@2970843e, enableForcibleNodeKill=false, enableTroubleshootingLog=false, locAddr=null, locHost=null, locPort=47100, locPortRange=100, shmemPort=-1, directBuf=true, directSndBuf=false, idleConnTimeout=600000, connTimeout=5000, maxConnTimeout=600000, reconCnt=10, sockSndBuf=32768, sockRcvBuf=32768, msgQueueLimit=0, slowClientQueueLimit=0, nioSrvr=null, shmemSrv=null, usePairedConnections=false, connectionsPerNode=1, tcpNoDelay=true, filterReachableAddresses=false, ackSndThreshold=32, unackedMsgsBufSize=0, sockWriteTimeout=2000, boundTcpPort=-1, boundTcpShmemPort=-1, selectorsCnt=6, selectorSpins=0, addrRslvr=null, ctxInitLatch=java.util.concurrent.CountDownLatch@6c599916[Count = 1], stopping=false], evtSpi=org.apache.ignite.spi.eventstorage.NoopEventStorageSpi@4d4cb71e, colSpi=NoopCollisionSpi [], deploySpi=LocalDeploymentSpi [], indexingSpi=org.apache.ignite.spi.indexing.noop.NoopIndexingSpi@4fc1f835, addrRslvr=null, encryptionSpi=org.apache.ignite.spi.encryption.noop.NoopEncryptionSpi@38875a4a, clientMode=true, rebalanceThreadPoolSize=1, txCfg=TransactionConfiguration [txSerEnabled=false, dfltIsolation=REPEATABLE_READ, dfltConcurrency=PESSIMISTIC, dfltTxTimeout=0, txTimeoutOnPartitionMapExchange=0, pessimisticTxLogSize=0, pessimisticTxLogLinger=10000, tmLookupClsName=null, txManagerFactory=null, useJtaSync=false], cacheSanityCheckEnabled=true, discoStartupDelay=60000, deployMode=SHARED, p2pMissedCacheSize=100, locHost=null, timeSrvPortBase=31100, timeSrvPortRange=100, failureDetectionTimeout=10000, sysWorkerBlockedTimeout=null, clientFailureDetectionTimeout=30000, metricsLogFreq=60000, hadoopCfg=null, connectorCfg=ConnectorConfiguration [jettyPath=null, host=null, port=11211, noDelay=true, directBuf=false, sndBufSize=32768, rcvBufSize=32768, idleQryCurTimeout=600000, idleQryCurCheckFreq=60000, sndQueueLimit=0, selectorCnt=4, idleTimeout=7000, sslEnabled=false, sslClientAuth=false, sslCtxFactory=null, sslFactory=null, portRange=100, threadPoolSize=12, msgInterceptor=null], odbcCfg=null, warmupClos=null, atomicCfg=AtomicConfiguration [seqReserveSize=1000, cacheMode=PARTITIONED, backups=1, aff=null, grpName=null], classLdr=null, sslCtxFactory=null, platformCfg=null, binaryCfg=null, memCfg=null, pstCfg=null, dsCfg=null, activeOnStart=true, autoActivation=true, longQryWarnTimeout=3000, sqlConnCfg=null, cliConnCfg=ClientConnectorConfiguration [host=null, port=10800, portRange=100, sockSndBufSize=0, sockRcvBufSize=0, tcpNoDelay=true, maxOpenCursorsPerConn=128, threadPoolSize=12, idleTimeout=0, jdbcEnabled=true, odbcEnabled=true, thinCliEnabled=true, sslEnabled=false, useIgniteSslCtxFactory=true, sslClientAuth=false, sslCtxFactory=null], mvccVacuumThreadCnt=2, mvccVacuumFreq=5000, authEnabled=false, failureHnd=null, commFailureRslvr=null]
[08:27:47][INFO ][Thread-3] Daemon mode: off
[08:27:47][INFO ][Thread-3] OS: Linux 4.9.0-11-amd64 amd64
[08:27:47][INFO ][Thread-3] OS user: root
[08:27:47][INFO ][Thread-3] PID: 151
[08:27:47][INFO ][Thread-3] Language runtime: Java Platform API Specification ver. 1.8
[08:27:47][INFO ][Thread-3] VM information: OpenJDK Runtime Environment 1.8.0_282-b08 Oracle Corporation OpenJDK 64-Bit Server VM 25.282-b08
[08:27:47][INFO ][Thread-3] VM total memory: 14.0GB
[08:27:47][INFO ][Thread-3] Remote Management [restart: off, REST: off, JMX (remote: off)]
[08:27:47][INFO ][Thread-3] Logger: Log4J2Logger [quiet=false, config=file:/opt/ycsb-0.17.0/ignite-binding/lib/ignite-binding-0.17.0.jar!/log4j2.xml]
[08:27:47][INFO ][Thread-3] IGNITE_HOME=null
[08:27:47][INFO ][Thread-3] VM arguments: []
[08:27:47][INFO ][Thread-3] Configured caches [in 'sysMemPlc' dataRegion: ['ignite-sys-cache']]
[08:27:47][WARN ][Thread-3] Please set system property '-Djava.net.preferIPv4Stack=true' to avoid possible problems in mixed environments.
[08:27:48][INFO ][Thread-3] Configured plugins:
[08:27:48][INFO ][Thread-3]   ^-- None
[08:27:48][INFO ][Thread-3] 
[08:27:48][INFO ][Thread-3] Configured failure handler: [hnd=StopNodeOrHaltFailureHandler [tryStop=false, timeout=0, super=AbstractFailureHandler [ignoredFailureTypes=[SYSTEM_WORKER_BLOCKED]]]]
[08:27:48][INFO ][Thread-3] Successfully bound communication NIO server to TCP port [port=47100, locHost=0.0.0.0/0.0.0.0, selectorsCnt=6, selectorSpins=0, pairedConn=false]
[08:27:48][WARN ][Thread-3] Message queue limit is set to 0 which may lead to potential OOMEs when running cache operations in FULL_ASYNC or PRIMARY_SYNC modes due to message queues growth on sender and receiver sides.
[08:27:48][WARN ][Thread-3] Checkpoints are disabled (to enable configure any GridCheckpointSpi implementation)
[08:27:48][WARN ][Thread-3] Collision resolution is disabled (all jobs will be activated upon arrival).
[08:27:48][INFO ][Thread-3] Security status [authentication=off, tls/ssl=off]
[08:27:48][INFO ][Thread-3] Evict partition permits=3
[08:27:48][INFO ][Thread-3] Client connector processor has started on TCP port 10800
[08:27:48][INFO ][Thread-3] REST protocols do not start on client node. To start the protocols on client node set '-DIGNITE_REST_START_ON_CLIENT=true' system property.
[08:27:49][INFO ][Thread-3] Non-loopback local IPs: 172.20.0.10
[08:27:49][INFO ][Thread-3] Enabled local MACs: 0242AC14000A
[08:27:49][INFO ][disco-notifier-worker-#46%YCSB client node%] Assigned mvcc coordinator [crd=MvccCoordinator [nodeId=85b52e20-c8d6-406a-afc2-635e3ba49253, crdVer=1613982174803, topVer=AffinityTopologyVersion [topVer=17, minorTopVer=0]], crdNode=TcpDiscoveryNode [id=85b52e20-c8d6-406a-afc2-635e3ba49253, addrs=[127.0.0.1, 172.20.0.2], sockAddrs=[/127.0.0.1:47500, 5265fead3659/172.20.0.2:47500], discPort=47500, order=1, intOrder=1, lastExchangeTime=1613982469597, loc=false, ver=2.7.0#20181130-sha1:256ae401, isClient=false]]
[08:27:49][INFO ][exchange-worker-#48%YCSB client node%] Started exchange init [topVer=AffinityTopologyVersion [topVer=17, minorTopVer=0], mvccCrd=MvccCoordinator [nodeId=85b52e20-c8d6-406a-afc2-635e3ba49253, crdVer=1613982174803, topVer=AffinityTopologyVersion [topVer=17, minorTopVer=0]], mvccCrdChange=true, crd=false, evt=NODE_JOINED, evtNode=52283a70-2150-44ff-8dd7-d664ba8cd78b, customEvt=null, allowMerge=true]
[08:27:49][INFO ][exchange-worker-#48%YCSB client node%] Components activation performed in 0 ms.
[08:27:50][INFO ][exchange-worker-#48%YCSB client node%] Started cache [name=ignite-sys-cache, id=-2100569601, memoryPolicyName=sysMemPlc, mode=REPLICATED, atomicity=TRANSACTIONAL, backups=2147483647, mvcc=false], encryptionEnabled=false]
[08:27:50][INFO ][exchange-worker-#48%YCSB client node%] Starting caches on local join performed in 193 ms.
[08:27:50][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:49772, rmtAddr=5265fead3659/172.20.0.2:47100]
[08:27:50][INFO ][exchange-worker-#48%YCSB client node%] Sending Single Message performed in 30 ms.
[08:27:50][INFO ][exchange-worker-#48%YCSB client node%] Finished exchange init [topVer=AffinityTopologyVersion [topVer=17, minorTopVer=0], crd=false]
[08:27:50][INFO ][sys-#49%YCSB client node%] Received full message, will finish exchange [node=85b52e20-c8d6-406a-afc2-635e3ba49253, resVer=AffinityTopologyVersion [topVer=17, minorTopVer=0]]
[08:27:50][INFO ][sys-#49%YCSB client node%] Affinity initialization on local join performed in 16 ms.
[08:27:50][INFO ][sys-#49%YCSB client node%] Affinity changes applied in 16 ms.
[08:27:50][INFO ][sys-#49%YCSB client node%] Full map updating for 2 groups performed in 3 ms.
[08:27:50][INFO ][sys-#49%YCSB client node%] Finish exchange future [startVer=AffinityTopologyVersion [topVer=17, minorTopVer=0], resVer=AffinityTopologyVersion [topVer=17, minorTopVer=0], err=null]
[08:27:50][INFO ][sys-#49%YCSB client node%] Finish proxy initialization, cacheName=ignite-sys-cache, localNodeId=52283a70-2150-44ff-8dd7-d664ba8cd78b
[08:27:50][INFO ][sys-#49%YCSB client node%] Completed partition exchange [localNode=52283a70-2150-44ff-8dd7-d664ba8cd78b, exchange=GridDhtPartitionsExchangeFuture [topVer=AffinityTopologyVersion [topVer=17, minorTopVer=0], evt=NODE_JOINED, evtNode=TcpDiscoveryNode [id=52283a70-2150-44ff-8dd7-d664ba8cd78b, addrs=[127.0.0.1, 172.20.0.10], sockAddrs=[/127.0.0.1:0, dc789c38b55b/172.20.0.10:0], discPort=0, order=17, intOrder=0, lastExchangeTime=1613982469071, loc=true, ver=2.7.0#20181130-sha1:256ae401, isClient=true], done=true], topVer=AffinityTopologyVersion [topVer=17, minorTopVer=0], durationFromInit=369]
[08:27:50][INFO ][exchange-worker-#48%YCSB client node%] Skipping rebalancing (no affinity changes) [top=AffinityTopologyVersion [topVer=17, minorTopVer=0], rebTopVer=AffinityTopologyVersion [topVer=-1, minorTopVer=0], evt=NODE_JOINED, evtNode=52283a70-2150-44ff-8dd7-d664ba8cd78b, client=true]
[08:27:50][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:56956, rmtAddr=f24854ef9acd/172.20.0.12:47100]
[08:27:50][INFO ][Thread-3] Performance suggestions for grid 'YCSB client node' (fix if possible)
[08:27:50][INFO ][Thread-3] To disable, set -DIGNITE_PERFORMANCE_SUGGESTIONS_DISABLED=true
[08:27:50][INFO ][Thread-3]   ^-- Enable G1 Garbage Collector (add '-XX:+UseG1GC' to JVM options)
[08:27:50][INFO ][Thread-3]   ^-- Specify JVM heap max size (add '-Xmx<size>[g|G|m|M|k|K]' to JVM options)
[08:27:50][INFO ][Thread-3]   ^-- Set max direct memory size if getting 'OOME: Direct buffer memory' (add '-XX:MaxDirectMemorySize=<size>[g|G|m|M|k|K]' to JVM options)
[08:27:50][INFO ][Thread-3]   ^-- Disable processing of calls to System.gc() (add '-XX:+DisableExplicitGC' to JVM options)
[08:27:50][INFO ][Thread-3] Refer to this page for more performance suggestions: https://apacheignite.readme.io/docs/jvm-and-system-tuning
[08:27:50][INFO ][Thread-3] 
[08:27:50][INFO ][Thread-3] To start Console Management & Monitoring run ignitevisorcmd.{sh|bat}
[08:27:50][INFO ][Thread-3] 

>>> +----------------------------------------------------------------------+
>>> Ignite ver. 2.7.0#20181130-sha1:256ae4012cb143b4855b598b740a6f3499ead4db
>>> +----------------------------------------------------------------------+
>>> OS name: Linux 4.9.0-11-amd64 amd64
>>> CPU(s): 12
>>> Heap: 14.0GB
>>> VM name: 151@dc789c38b55b
>>> Ignite instance name: YCSB client node
>>> Local node [ID=52283A70-2150-44FF-8DD7-D664BA8CD78B, order=17, clientMode=true]
>>> Local node addresses: [dc789c38b55b/127.0.0.1, /172.20.0.10]
>>> Local ports: TCP:10800 TCP:47100 

[08:27:50][INFO ][Thread-3] Topology snapshot [ver=17, locNode=52283a70, servers=14, clients=1, state=ACTIVE, CPUs=180, offheap=180.0GB, heap=28.0GB]
[08:27:50][INFO ][Thread-3] Activate Ignite cluster.
[08:27:50][INFO ][Thread-3] Sending activate request from node [id=52283a70-2150-44ff-8dd7-d664ba8cd78b, topVer=AffinityTopologyVersion [topVer=17, minorTopVer=0], client=true, daemon=false]
[08:27:50][INFO ][grid-nio-worker-tcp-comm-2-#34%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:55838, rmtAddr=b4766e5dcf84/172.20.0.14:47100]
[08:27:50][INFO ][exchange-worker-#48%YCSB client node%] Started cache [name=usertable, id=358348515, memoryPolicyName=null, mode=PARTITIONED, atomicity=ATOMIC, backups=1, mvcc=false], encryptionEnabled=false]
[08:27:50][INFO ][grid-nio-worker-tcp-comm-3-#35%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:43832, rmtAddr=c7ff3492ae99/172.20.0.11:47100]
[08:27:50][INFO ][exchange-worker-#48%YCSB client node%] Finish proxy initialization, cacheName=usertable, localNodeId=52283a70-2150-44ff-8dd7-d664ba8cd78b
[08:27:50][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:60182, rmtAddr=79cac280ab79/172.20.0.6:47100]
[08:27:50][INFO ][grid-nio-worker-tcp-comm-5-#37%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:35094, rmtAddr=6b3717c6be1f/172.20.0.13:47100]
[08:27:50][INFO ][grid-nio-worker-tcp-comm-4-#36%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:50180, rmtAddr=7863ef5f2863/172.20.0.3:47100]
[08:27:50][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:53032, rmtAddr=1910377fa87a/172.20.0.7:47100]
[08:27:51][INFO ][grid-nio-worker-tcp-comm-2-#34%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:45582, rmtAddr=ccbd95889d7e/172.20.0.5:47100]
[08:27:51][INFO ][grid-nio-worker-tcp-comm-3-#35%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.16:33830]
[08:27:51][INFO ][grid-nio-worker-tcp-comm-4-#36%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:39868, rmtAddr=c488e34dddec/172.20.0.4:47100]
[08:27:51][INFO ][grid-nio-worker-tcp-comm-5-#37%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.15:54270]
[08:27:51][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Established outgoing communication connection [locAddr=/172.20.0.10:51006, rmtAddr=5a434cd01e7b/172.20.0.9:47100]
[08:27:52][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Accepted incoming communication connection [locAddr=/172.20.0.10:47100, rmtAddr=/172.20.0.8:43796]
[08:27:59][WARN ][ignite-update-notifier-timer] New version is available at ignite.apache.org: 2.9.1
[08:28:14][INFO ][Thread-6] Stopped cache [cacheName=ignite-sys-cache]
[08:28:14][INFO ][Thread-6] Stopped cache [cacheName=usertable]
[08:28:14][INFO ][Thread-6] 

>>> +---------------------------------------------------------------------------------+
>>> Ignite ver. 2.7.0#20181130-sha1:256ae4012cb143b4855b598b740a6f3499ead4db stopped OK
>>> +---------------------------------------------------------------------------------+
>>> Ignite instance name: YCSB client node
>>> Grid uptime: 00:00:24.055


[OVERALL], RunTime(ms), 26986
[OVERALL], Throughput(ops/sec), 370.5625138960943
[TOTAL_GCS_PS_Scavenge], Count, 3
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 26
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0963462536129845
[TOTAL_GCS_PS_MarkSweep], Count, 2
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 62
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.22974875861557845
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 88
[TOTAL_GC_TIME_%], Time(%), 0.32609501222856296
[READ], Operations, 5058
[READ], AverageLatency(us), 4701.883748517201
[READ], MinLatency(us), 3472
[READ], MaxLatency(us), 273407
[READ], 95thPercentileLatency(us), 5395
[READ], 99thPercentileLatency(us), 7879
[READ], Return=OK, 5058
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 39223.0
[CLEANUP], MinLatency(us), 7
[CLEANUP], MaxLatency(us), 156927
[CLEANUP], 95thPercentileLatency(us), 156927
[CLEANUP], 99thPercentileLatency(us), 156927
[UPDATE], Operations, 4942
[UPDATE], AverageLatency(us), 14095.850263051396
[UPDATE], MinLatency(us), 10840
[UPDATE], MaxLatency(us), 1169407
[UPDATE], 95thPercentileLatency(us), 15447
[UPDATE], 99thPercentileLatency(us), 20207
[UPDATE], Return=OK, 4942